//
//  PostStorage.swift
//  Navigation
//
//  Created by Maria Mezhova on 03.06.2021.
//  Copyright © 2021 Artem Novichkov. All rights reserved.
//

import UIKit

struct PostWall {
    static let tableViewPost = [
        PostTable(author: "Netflix ,new season serial RAGNAROK", description: "New season \"2\" Norway serial Ragnarok, about Scandinavian myths", image: "Ragnarok", likes: 200, views: 1900),
        PostTable(author: "Netflix Serials",description: "Third Season: В 1984 году советские военные пытаются открыть свой портал в параллельное измерение, но терпят неудачу. Следующую попытку они откладывают на год. Летом 1985 года в Хоукинсе открывается торговый центр «Старкорт», куда ходит весь город. У Майка и Оди развиваются романтические отношения, что вызывает недовольство шерифа Хоппера, которому удается их рассорить. Дастин возвращается из летнего научного лагеря и вместе со своими друзьями Майком, Уиллом, Лукасом, Оди и Макс разворачивает на холме любительскую радиостанцию, чтобы связаться со своей подругой Сьюзи, с которой познакомился в лагере. Дастину удается перехватить радиосигнал от русских, передающих зашифрованное сообщение.", image: "The Things Strange", likes: 180, views: 290),
        PostTable(author: "Apple", description: "Напомним, ARM-процессор Apple M1 обладает восемью ядрами, разделёнными на два кластера: четыре мощных ядра Firestorm и четыре энергоэффективных Icestorm. Встроенный графический процессор имеет восемь ядер, на которые приходится 128 исполнительных блоков. Частоты ни CPU, ни GPU не уточняются, потому как зависят от компьютера, в котором используется чип: в MacBook Air они ниже, нежели в MacBook Pro 13 и Mac mini. В случае последнего частота мощных ядер Firestorm достигает 3,2 ГГц в однопоточных нагрузках, и 3,0 ГГц в многопоточных.", image: "m1", likes: 1980, views: 2780),
        PostTable(author: "Huyndai", description: "Hyundai Santa Fe — среднеразмерный кроссовер, созданный на платформе Hyundai Sonata. Автомобиль был назван в честь города в Нью-Мексико. В 2001 году эта модель была первым кроссовером Hyundai, выпущенным в то же время, что и Ford Escape/Mazda Tribute и Pontiac Aztek. Santa Fe был основой программы реструктуризации компании в конце 1990-х. И, несмотря на полученную критику со стороны журналистов за его невнятный вид, автомобиль пользовался успехом в Америке. Кроссовер был настолько популярен, что порой Hyundai не справлялся с обеспечением имеющегося спроса.", image: "Santa_Fe", likes: 777, views: 999)]
}
